{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2\n",
    "Дана двухслойная классифицирующая нейросеть, с логистической (сигмоидной) функцией активации у нейронов выходного слоя (см. рис.).\n",
    "\n",
    "Требуется определить класс объекта для заданного входа (-0,6, 0,8) и весов нейросети, заданных в виде матрицы:\n",
    "\n",
    "W = np.array([[-1.5, 1, 1],[-0.5, 1, -1],[5, -10, 0]])\n",
    "В ответе укажите произведение номера класса объекта (число 1,  2 или 3), умноженное на выход соответствующего нейрона нейросети с абс.точностью не менее 0,01.\n",
    "Дробную часть отделите от целой точкой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-1.9000000000000001 0.13010847436299783\n",
      "11.0 0.999983298578152\n",
      "2.9999498957344564\n",
      "3.0\n"
     ]
    }
   ],
   "source": [
    "x = [1.0, -0.6, 0.8]\n",
    "\n",
    "W = np.array([[-1.5, 1, 1],[-0.5, 1, -1],[5, -10, 0]])\n",
    "\n",
    "def sigmoid(u):\n",
    "    return 1 / (1 + np.exp(-u))\n",
    "\n",
    "print(x @ W[0], sigmoid(x @ W[0]))\n",
    "print(x @ W[1], sigmoid(x @ W[1]))\n",
    "print(x @ W[2], sigmoid(x @ W[2]))\n",
    "\n",
    "print(3 * sigmoid(x @ W[2]))\n",
    "print(np.round(3 * sigmoid(x @ W[2]),2))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3\n",
    "\n",
    "Дана двухслойная классифицирующая нейросеть, с функцией активации у нейронов выходного слоя softmax (см. рис.). \n",
    "\n",
    "Требуется определить класс объекта для заданного входа (-0,4, -0,6) и весов нейросети, заданных в виде матрицы:\n",
    "\n",
    "W = np.array([[-1.5, 1, 1],[-0.5, 1, -1],[5, -10, 0]])\n",
    "В ответе укажите произведение номера класса объекта (число 1,  2 или 3), умноженное на выход соответствующего нейрона нейросети с абс.точностью не менее 0,01.\n",
    "Дробную часть отделите от целой точкой.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[-2.5, -0.30000000000000004, 9.0]\n",
      "[1.012906494827623e-05, 9.141494789483794e-05, 0.9998984559871569]\n",
      "2.9996953679614706\n",
      "3.0\n"
     ]
    }
   ],
   "source": [
    "x = [1.0, -0.4, -0.6]\n",
    "W = np.array([[-1.5, 1, 1],[-0.5, 1, -1],[5, -10, 0]])\n",
    "\n",
    "u = [x @ W[0], x @ W[1], x @ W[2]]\n",
    "print(u)\n",
    "\n",
    "def softmax(u):\n",
    "    sum = 0\n",
    "    for i in u:\n",
    "        sum += np.exp(i)\n",
    "    result = []\n",
    "    for i in u:\n",
    "        result.append(np.exp(i) / sum)\n",
    "    return result\n",
    "\n",
    "sm = softmax(u)\n",
    "\n",
    "print(sm)\n",
    "print(3 * sm[2])\n",
    "print(np.round(3 * sm[2], 2))\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4\n",
    "\n",
    "Пусть у нас имеется нейрон вида:\n",
    "\n",
    "с функцией активации sign(u) = +1, если u>0 и sign(u) = -1, если u < 0 (0, при u = 0).\n",
    "\n",
    "Один шаг обучения нейрона по правилу Хебба выглядит так:\n",
    "\n",
    "если нейрон ошибается с прогнозом класса объекта (x,y), то веса корректируются по формуле: Wi = Wi + lr*y*xi.\n",
    "Здесь x1 = x, x0 = +1, lr - коэффициент обучения.\n",
    "\n",
    "Выполните один шаг обучения нейрона по правилу Хебба с использованием в качестве объекта точку (x,y) = (3, -1) с коэффициентом  обучения lr=0.5 из начального приближения W0= -2, W1= 3.\n",
    "\n",
    "В ответе напишите новое значение веса W1, с абсолютной точностью не менее 0.01. \n",
    "\n",
    "Дробную часть отделяйте точкой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "u: 7.0\n",
      "ym: 1.0\n",
      "W0: -2.5\n",
      "W1: 1.5\n"
     ]
    }
   ],
   "source": [
    "x = 3\n",
    "y = -1\n",
    "\n",
    "W = [-2., 3.]\n",
    "l = .5\n",
    "\n",
    "u = W[0] + W[1]*x\n",
    "print('u:', u)\n",
    "\n",
    "ym = np.sign(u)\n",
    "print('ym:', ym)\n",
    "\n",
    "print('W0:', W[0] + l*y)\n",
    "print('W1:', W[1] + l*y*x)\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5\n",
    "\n",
    "Пусть у нас имеется нейрон вида:\n",
    "\n",
    "с сигмоидной функцией активации fa(u) = 1/(1+exp(-u)).\n",
    "\n",
    "Один шаг обучения нейрона по правилу Видроу-Хоффа выглядит так:\n",
    "\n",
    "веса на объекте (x,y) корректируются по формуле: Wi = Wi + lr*(y-ym(x))*xi.\n",
    "Здесь x1= x, x0= +1, lr - коэффициент обучения, ym(x) - реакция (выход) нейрона на вход x.\n",
    "\n",
    "Выполните один шаг обучения нейрона по правилу Видроу-Хоффа с использованием в качестве объекта точки (x,y) = (5, -1) с коэффициентом  обучения lr=0.5 из начального приближения W0= -2, W1= 3.\n",
    "\n",
    "В ответе напишите новое значение веса W1, с абсолютной точностью не менее 0.01. \n",
    "\n",
    "Дробную часть отделяйте точкой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "u: 13.0\n",
      "ym: 0.999997739675702\n",
      "W0: -2.9999988698378512\n",
      "W1: -1.9999943491892553\n"
     ]
    }
   ],
   "source": [
    "def sigmoid(u):\n",
    "    return 1 / (1 + np.exp(-u))\n",
    "\n",
    "x = 5\n",
    "y = -1\n",
    "\n",
    "l = .5\n",
    "\n",
    "W = [-2., 3.]\n",
    "\n",
    "u = W[0] + W[1]*x\n",
    "print('u:', u)\n",
    "\n",
    "ym = sigmoid(u)\n",
    "print('ym:', ym)\n",
    "\n",
    "print('W0:', W[0] + l*(y-ym))\n",
    "print('W1:', W[1] + l*(y-ym)*x)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.8"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "26de051ba29f2982a8de78e945f0abaf191376122a1563185a90213a26c5da77"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
