{"cells":[{"cell_type":"markdown","metadata":{"id":"r2Ndck96v1ZI"},"source":["# Классная работа №2\n","---\n","Выполнил студент гр.ПС-2.. **Студентов Иван**"]},{"cell_type":"markdown","metadata":{"id":"3--9KQKjws7T"},"source":["## Однофамильцы\n","\n","Kлассная работа\n","макс. 2 балла\n","\n","---\n","Начальник кадровой службы хочет узнать, есть ли мужчины-однофамильцы в организации. У него есть список фамилий, и на основании этого списка нужно определить фамилии, которые совпадают с другими.\n","\n","**Формат ввода**\n","\n","В первой строке указывается количество мужчин - сотрудников организации (N). Затем идут N строк с фамилиями этих сотрудников в произвольном порядке.\n","\n","**Формат вывода**\n","\n","Словарь с фамилиями однофамильцев и их количеством вида:\n","\n","{Петров:2, Сидоров:3}\n","\n","Если однофамильцев нет, то вывести число 0\n","\n","**Пример 1**\n","\n","Ввод |\tВывод\n","--- | ---\n","6 | {'Иванов':2, 'Петров':3}\n","Иванов |\n","Петров |\n","Сидоров |\n","Петров |\n","Иванов |\n","Петров | \n","\n","**Пример 2**\n","\n","Ввод |\tВывод\n","--- | ---\n","3 | 0\n","Иванов |\n","Петров |\n","Сидоров |\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"oH8mZb5GpFFE"},"outputs":[],"source":["n = int(input())\n","fiolist = []\n","for i in range(n):\n","    fiolist.append()"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"5CRyXimhpXKC","outputId":"92441ad9-961b-44fd-a8f5-4d0e40857a36"},"outputs":[{"data":{"text/plain":["['Иванов', 'Петров', 'Сидоров', 'Петров', 'Иванов', 'Петров']"]},"execution_count":3,"metadata":{},"output_type":"execute_result"}],"source":["fiolist = ['Иванов', 'Петров', 'Сидоров', 'Петров', 'Иванов', 'Петров']\n","fiolist"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"jsvmMurWptID"},"outputs":[],"source":["adict = {}\n","for fio in fiolist:\n","    if fio in adict:\n","        pass\n","    else:\n","        adict[fio] = 1"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"UiPmTgxpvuBs","outputId":"9213457e-3afc-4334-dc9e-b458b8a4ac86"},"outputs":[{"name":"stdout","output_type":"stream","text":["{'Иванов': 2, 'Петров': 3}\n"]}],"source":["adict = {'Иванов':2, 'Петров':3}\n","print(adict)"]},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"eHIgGp3Ap6eo","outputId":"1ee2b4c5-2a91-4dac-d4a7-6a288d01700c"},"outputs":[{"data":{"text/plain":["dict_values([2, 3])"]},"execution_count":6,"metadata":{},"output_type":"execute_result"}],"source":["adict.keys(), adict.values()"]},{"cell_type":"markdown","metadata":{"id":"WMlENOx86ya8"},"source":["### Program"]},{"cell_type":"code","execution_count":41,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":26965,"status":"ok","timestamp":1663326343240,"user":{"displayName":"Сергей Васин","userId":"14530971202996272660"},"user_tz":-180},"id":"79C8Ga_8Yu2Y","outputId":"af90c1cf-0a26-4caa-b574-769e581d0188"},"outputs":[{"name":"stdout","output_type":"stream","text":["Введите количество сотрудников: 6\n","Введите фамилию: Иванов\n","Введите фамилию: Петров\n","Введите фамилию: иванов\n","Введите фамилию: ПЕтров\n","Введите фамилию: ИВАНОВ\n","Введите фамилию: И один Сидоров\n","{'Иванов': 3, 'Петров': 2}\n"]}],"source":["n = int(input('Введите количество сотрудников: '))\n","fiolist = []\n","for i in range(n):\n","    fiolist.append(input('Введите фамилию: '))\n","\n","''' tests\n","# n = 6\n","# fiolist = ['Иванов', 'Петров', 'Сидоров', 'Петров', 'Иванов', 'Петров']\n","# fiolist = ['Сидоров', 'Иванов', 'Петров', 'Петров', 'Иванов', 'Петров']\n","# fiolist = ['Сидоров', 'ИВАНОВ', 'ПЕтров', 'Петров', 'Иванов', 'Петров']\n","\n","n = 3\n","fiolist = ['Сидоров', 'Иванов', 'Петров']\n","'''\n","\n","adict = {}\n","for fio in fiolist:\n","    fionorm = fio.lower().capitalize()\n","    if fionorm in adict:\n","        adict[fionorm] += 1\n","    else:\n","        adict[fionorm] = 1\n","\n","singulars = []\n","\n","for fio in adict:\n","    if adict[fio] == 1:\n","        singulars.append(fio)\n","\n","for s in singulars:\n","    adict.pop(s)\n","\n","if adict:\n","    print(adict)\n","else:\n","    print(0)\n"]}],"metadata":{"colab":{"collapsed_sections":[],"provenance":[]},"kernelspec":{"display_name":"Python 3.10.1 64-bit","language":"python","name":"python3"},"language_info":{"name":"python","version":"3.10.1"},"vscode":{"interpreter":{"hash":"26de051ba29f2982a8de78e945f0abaf191376122a1563185a90213a26c5da77"}}},"nbformat":4,"nbformat_minor":0}
