{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "r2Ndck96v1ZI"
      },
      "source": [
        "# Домашняя работа №2\n",
        "---\n",
        "Выполнил студент гр. ИВТ-31 **Васин Сергей**"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "3--9KQKjws7T"
      },
      "source": [
        "## Проверка чека\n",
        "\n",
        "Домашняя работа\n",
        "макс. 2 балл.\n",
        "\n",
        "---\n",
        "Напишите программу, которая проверяет чек из магазина. На чеке указано, по каким ценам и в каком количестве куплены товары, общая стоимость данного товара (т. е. данной позиции в чеке), а также суммарная итоговая стоимостью. Конечно, по цене и количеству можно узнать стоимость, и суммарную стоимость тоже можно рассчитать. Программа должна проверить, правильно ли рассчитана стоимость каждой позиции и правильно ли рассчитана общая сумма, и если присутствуют ошибки, то указать, где именно.\n",
        "\n",
        "Формат ввода\n",
        "\n",
        "На первой строке записано количество позиций N (оно меньше 1000 и дополнено справа пробелами, чтобы достигнуть длины в 4 символа) и общая сумма (целое число).\n",
        "\n",
        "Далее следует N позиций чека, каждая из которых записана на отдельной строке и соответствует покупке нескольких единиц некоторого товара.\n",
        "Сначала записана цена товара (она может быть дополнена справа пробелами), затем знак «*», затем количество этих товаров (оно может быть дополнено справа пробелами до 4 символов), затем знак «=», затем стоимость данной позиции.\n",
        "\n",
        "Формат вывода\n",
        "\n",
        "Нужно вывести разность между указанной итоговой суммой и истинной суммой стоимостей по всем позициям.\n",
        "\n",
        "Далее нужно вывести в порядке возрастания номера всех позиций (нумерация с 1), в которых указанная стоимость расходится со стоимостью, которую можно рассчитать из цены и количества товара.\n",
        "\n",
        "Пример 1\n",
        "\n",
        "Ввод |\tВывод\n",
        "--- | ---\n",
        "3   3144 | 0\n",
        "15     *3   =45 |\n",
        "100    *1   =100 |\n",
        "2999   *1   =2999 |\n",
        "\n",
        "Пример 2\n",
        "\n",
        "Ввод |\tВывод\n",
        "--- | ---\n",
        "3   2300 | 58\n",
        "99     *2   =199 | 1 1\n",
        "20     *100 =2000 | 3 11\n",
        "11     *4   =55 |\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "UiPmTgxpvuBs"
      },
      "outputs": [],
      "source": [
        "# Решение"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "UPxVdXD9aUrm",
        "outputId": "14f9dd0a-0fc1-4f84-cea1-5933f3295b98"
      },
      "outputs": [
        {
          "data": {
            "text/plain": [
              "('23 * 5 ', ' 115')"
            ]
          },
          "execution_count": 1,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "a_str = '23 * 5 = 115'\n",
        "\n",
        "ab, s = a_str.split('=')\n",
        "ab, s"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {},
      "source": [
        "### Program"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 30,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "0\n"
          ]
        }
      ],
      "source": [
        "n, total = [int(s) for s in input('Введите количество товара и общую сумму: ').split()]\n",
        "\n",
        "positions = []\n",
        "for i in range(n):\n",
        "    positions.append([int(x) for x in input('Введите позицию: ').replace('*', ' ').replace('=', ' ').split()])\n",
        "\n",
        "result = []\n",
        "ptotal = 0\n",
        "\n",
        "for i, p in enumerate(positions):\n",
        "    psum = p[0] * p[1]\n",
        "    ptotal += psum\n",
        "    if psum != p[2]:\n",
        "        result.append([i+1, p[2] - psum])\n",
        "\n",
        "if total == ptotal:\n",
        "    result.insert(0, 0)\n",
        "else:\n",
        "    result.insert(0, total - ptotal)\n",
        "\n",
        "print(result[0])\n",
        "\n",
        "for r in result[1:]:\n",
        "    print(*r)\n",
        "\n",
        "\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {},
      "source": [
        "### Tests\n",
        "\n",
        "```\n",
        "# 3   3144 | 0\n",
        "# 15     *3   =45 |\n",
        "# 100    *1   =100 |\n",
        "# 2999   *1   =2999 |\n",
        "n = 3\n",
        "total = 3144\n",
        "positions = [[15, 3, 45], [100, 1, 100], [2999, 1, 2999]]\n",
        "```\n",
        "\n",
        "```\n",
        "# 3   2300 | 58\n",
        "# 99     *2   =199 | 1 1\n",
        "# 20     *100 =2000 | 3 11\n",
        "# 11     *4   =55 |\n",
        "n = 3\n",
        "total = 2300\n",
        "positions = [[99, 2, 199], [20, 100, 2000], [11, 4, 55]]\n",
        "```\n",
        "\n",
        "```\n",
        "# 4\t345\t\n",
        "# 11\t2\t45\n",
        "# 43\t23\t1888\n",
        "# 50\t2\t100\n",
        "# 22\t1\t21\n",
        "n = 4\n",
        "total = 345\n",
        "positions = [[11, 2, 45], [43, 23, 1888], [50, 2, 100], [22, 1, 21]]\n",
        "```"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "collapsed_sections": [],
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3.10.1 64-bit",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "name": "python",
      "version": "3.10.1"
    },
    "vscode": {
      "interpreter": {
        "hash": "26de051ba29f2982a8de78e945f0abaf191376122a1563185a90213a26c5da77"
      }
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
